src/Catalogs/JIRA_Статусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>JIRA_Статусы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияСтатуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.JIRA_КатегорииСтатусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/JIRA_Статусы/Ext/ManagerModule.bsl
Функция НайтиСоздатьСтатус(Данные) Экспорт
	
	Если Данные = Неопределено Тогда
		Возврат Справочники.JIRA_Статусы.ПустаяСсылка();
	КонецЕсли;
	
	НовыйОбъект = Неопределено;
	НайденнаяСсылка = Справочники.JIRA_Статусы.НайтиПоКоду(Данные["id"]);
	Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Если НайденнаяСсылка.КатегорияСтатуса = Справочники.JIRA_КатегорииСтатусов.ПустаяСсылка() 
			И Данные["statusCategory"] <> Неопределено Тогда
			НовыйОбъект = НайденнаяСсылка.ПолучитьОбъект();
		КонецЕсли;
	Иначе
		НовыйОбъект = Справочники.JIRA_Статусы.СоздатьЭлемент();		
	КонецЕсли;
	
	Если НовыйОбъект <> Неопределено Тогда
		НовыйОбъект.Код = 			Данные["id"];
		НовыйОбъект.Наименование = 	Данные["name"];
		
		Если Данные["description"] <> Неопределено Тогда
			НовыйОбъект.Описание = 		Данные["description"];
		КонецЕсли;
		
		Если Данные["statusCategory"] <> Неопределено Тогда
			НовыйОбъект.КатегорияСтатуса = Справочники.JIRA_КатегорииСтатусов.НайтиСоздатьКатегориюСтатуса(Данные["statusCategory"]);
		КонецЕсли;
		
		НовыйОбъект.Записать();
		
		НайденнаяСсылка = НовыйОбъект.Ссылка;
	КонецЕсли;
	
	Возврат НайденнаяСсылка;
	
КонецФункции
